# Performing Mathematical Operations in Pandas

Today, I will be exploring mathematical operations using pandas. Let's get started

In [1]:
# importing the necessary libraries
import pandas as pd
import numpy as np

In [2]:
# Creating a new dataframe
dataframe = pd.DataFrame()

In [3]:
s1 = ([12, 34, 56, 67, 34, 23, 34, 45])
s2 = ([23, 45, 12, 56, 67, 23, 45, 78])

In [4]:
dataframe = pd.DataFrame(s1)
dataframe.columns = ['Age']

In [5]:
dataframe

   Age
0   12
1   34
2   56
3   67
4   34
5   23
6   34
7   45

In [6]:
dataframe['Skill Level'] = s2

In [7]:
dataframe

   Age  Skill Level
0   12           23
1   34           45
2   56           12
3   67           56
4   34           67
5   23           23
6   34           45
7   45           78

In [8]:
s3 = pd.Series([23000, 45000, 12000, 56000, 67000, 23000, 45000, 78000])
dataframe['salary'] = s3

In [9]:
dataframe

   Age  Skill Level  salary
0   12           23   23000
1   34           45   45000
2   56           12   12000
3   67           56   56000
4   34           67   67000
5   23           23   23000
6   34           45   45000
7   45           78   78000

In [10]:
# checking for standard deviation
dataframe.std()

Age               17.577888
Skill Level       23.101871
salary         23101.870673
dtype: float64

In [11]:
dataframe.mean()

Age               38.125
Skill Level       43.625
salary         43625.000
dtype: float64

In [12]:
dataframe.max()

Age               67
Skill Level       78
salary         78000
dtype: int64

In [13]:
dataframe.min()

Age               12
Skill Level       12
salary         12000
dtype: int64

In [15]:
dataframe['salary'].sum()

349000

In [17]:
dataframe[0:5]

   Age  Skill Level  salary
0   12           23   23000
1   34           45   45000
2   56           12   12000
3   67           56   56000
4   34           67   67000

In [18]:
dataframe[2:6]

   Age  Skill Level  salary
2   56           12   12000
3   67           56   56000
4   34           67   67000
5   23           23   23000

In [19]:
dataframe.head()

   Age  Skill Level  salary
0   12           23   23000
1   34           45   45000
2   56           12   12000
3   67           56   56000
4   34           67   67000

In [20]:
dataframe.tail()

   Age  Skill Level  salary
3   67           56   56000
4   34           67   67000
5   23           23   23000
6   34           45   45000
7   45           78   78000